public_html/ADRC/08.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="it" xml:lang="it">
<head>
<!-- 2021-11-12 ven 13:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>ADRC - Lesson 08</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Alessandro Straziota" />
<link rel="stylesheet" href="/appunti.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><div id="content">
<h1 class="title">ADRC - Lesson 08</h1>
<div id="table-of-contents">
<h2>Indice</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org90880d7">1. Leader Election</a></li>
<li><a href="#orgd692147">2. Minimum Finding on Ring</a>
<ul>
<li><a href="#orge845475">2.1. <code>All-the-way</code> protocol</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org90880d7" class="outline-2">
<h2 id="org90880d7"><span class="section-number-2">1</span> Leader Election</h2>
<div class="outline-text-2" id="text-1">
<p>
In un sistema distribuito in molti casi si necessita che una singola entità coordini il lavoro delle altre
entità per la risoluzione di <i>task</i>.
La presenza di tale entità può essere necessaria per <i>semplificare</i> lo svoglimento di un task oppure
perché è richiesto per la natura stessa del problema.<br />
</p>

<p>
Il problema della scelta di un <b>leader</b> tra un insieme omogeneo e simmetrico di individui di una popolazione
è noto come il <b>Leader Election Problem</b>.
Generalmente il problema richiede di portare la rete da una configurazione iniziale in cui tutti i nodi
sono in uno stesso stato, ad una configurazione in cui tutti i nodi saranno in uno stato <code>follower</code> eccetto
uno solo che dovrà essere nello stato di <code>leader</code>.
Non ci sono restrizioni su quali nodi devono iniziare il task della leader election, e nemmeno su quali
nodi possono diventare leader.<br />
</p>

<p>
Si può pensare alla leader election come un metodo che <b>forza</b> la restrizione di <code>unique initiator</code>,
infatti eletto un leader è possibile risolvere il task con protocolli a <i>single initiator</i> semplicemente
ponendo il leader come nodo initiator.<br />
</p>

<p>
Consideriamo il problema sotto il seguente insieme <code>R</code> di restrizioni:
</p>
<ul class="org-ul">
<li><b>BL</b>: bidirectional links</li>
<li><b>C</b>: connectivity</li>
<li><b>TR</b>: total reliability</li>
</ul>

<p>
<b>THM 1</b> Sotto le restrizioni <code>R</code> non è <b>deterministicamente</b> possibile risolvere il problema della leader election
</p>

<p>
Questo teorema forte è conseguenza della condizione di <b>perfetta simmetria</b>
Il fenomeno della <b>simmetria perfetta</b> occorre quando una rete ha una struttura totalmente simmetrica
in modo tale che ogni nodo non è in grado in nessun modo di distinguersi da un altro.
Ciò significa che se tutti i nodi sono in uno stato interno \(\sigma\) ad uno stesso istante \(t\), da quel
momento in poi essi si comporteranno esattamente alla stessa identica maniera perché avranno la stessa
visione del mondo esterno.
Non potendosi comportare in maniera differente, i nodi cambieranno stato alla stessa maniera, e quindi
non è possibile arrivare in una situazione in cui un nodo avrà uno stato <i>diverso</i> dagli altri (il <code>leader</code>).<br />
</p>

<p>
Il problema della leader election è anche noto come <b>simmetry breaking</b>, perché appunto cerca di "rompere" tale simmetria tra i nodi.
Il teorema 1 ci dice però che per fare rompere la simmetria, le restrizioni <code>R</code> non sono sufficienti.
È necessario aggiungere la restrizione <code>Unique Indentifier</code> o <code>Initial Distinct Values</code> (in breve <code>ID</code>),
nella quale si assume che ogni nodo \(x\) è <b>univocamente identificato</b> da valore \(id(x)\), ovvero
che rispetta la seguente proprietà
\[
  \forall x,y \in V \;\; id(x) \neq id(y)
  \]
</p>

<p>
Notiamo che risolvere il task dell'elezione di un leader è risolvibile con con la restrizione <code>ID</code>:
per esempio si potrebbe eleggere come leader il nodo con <b>etichetta minima</b> (o <b>massima</b>).<br />
</p>
</div>
</div>

<div id="outline-container-orgd692147" class="outline-2">
<h2 id="orgd692147"><span class="section-number-2">2</span> Minimum Finding on Ring</h2>
<div class="outline-text-2" id="text-2">
<p>
Come accennato, trovare il nodo cone <i>etichetta minima</i> può essere sfruttato per l'elezione di un leader.
Consideriamo una rete ad <b>anello</b>, ovvero una tra le tipologie più <b>sparse</b> di grafo simmetrico connesso.<br />
</p>

<p>
Un anello è un grafo \(R = (\lbrace x_1, ..., x_n \rbrace, E)\) in cui l'insieme degli archi \(E\) è
definito come 
\[
  E \equiv \lbrace \lbrace x_i, x_{i+1} \rbrace \subseteq V | i = 1,2, ..., n-1  \rbrace \cup \lbrace \lbrace x_n, x_1 \rbrace \rbrace
  \]
</p>

<p>
<b>Oss.1</b> non è detto che gli <code>id</code> dei nodi siano globalmente <b>consistenti</b>, ovvero non è detto che
\(id(x_i) = i\), oppure che se \(id(x_i) = k\) allora per forza deve essere vero che \(id(x_{i+1}) = k+1\) e  \(id(x_{i-1}) = k-1\).<br />
</p>

<p>
<b>Oss.2</b> in un anello con \(n\) nodi ci sono <i>esattamente</i> \(n\) archi.<br />
</p>

<p>
Assumiamo in fine che ogni nodo condivide una stessa idea di <i>destra</i> e <i>sinistra</i>.
Ovvero se definiamo che il nodo destro di \(x_2\) è \(x_3\), allora il nodo destro di ogni nodo \(x_i\) sarà il nodo con indice \(i+1 \mod{n}\)<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>.
</p>
</div>

<div id="outline-container-orge845475" class="outline-3">
<h3 id="orge845475"><span class="section-number-3">2.1</span> <code>All-the-way</code> protocol</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Una prima idea abbastanza 
</p>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Note a pi&egrave; di pagina: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
il modulo è necessario perché il nodo a destra di \(x_n\) non può essere \(x_{n+1}\) in quanto non esiste, ma deve essere \(x_1\).
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="date">Data: 2021-11-04 gio 00:00</p>
<p class="author">Autore: Alessandro Straziota</p>
<p class="email">Email: <a href="mailto:alessandrostr95@gmail.com">alessandrostr95@gmail.com</a></p>
<p class="date">Created: 2021-11-12 ven 13:32</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
